---
kind: other
id: Methods.T:Autodesk.Revit.DB.ReferencePoint
source: html/026f3ac5-7eea-1bd0-3e18-300834c308cb.htm
---
# ReferencePoint Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.